app/Controllers/TesteSaida.php

INSERT INTO `agenda` (`Nome`, `Endereco`, `Telefone`) VALUES ('BARUFFI', 'XYT', '12312312')
---
	public function teste2()
	{
		$a = model('AgendaModel');
		$x =
		[
			"Nome" => "BARUFFI",
			"Endereco" => "XYT",
			"Telefone" => "12312312"
		];
		$a->save($x);